<?php
$serverlist = <<<SERVER
{
"list":[
{"name":"【推荐の_Tk34联盟服】","ip":"vvv.tk3434.icu:28887","version":"x24.03.04"},
{"name":"【推荐2の_Tk34联盟服】","ip":"vvv.tk3434.icu:38887","version":"x24.03.04"},

{"name":"【id0土豆服の原版挑战】   QQ群826823481","ip":"120.79.212.67:28887","version":"x24.03.04"},
{"name":"【id1土豆服の原版无害】   QQ群826823481","ip":"120.79.212.67:38887","version":"x24.03.04"},
{"name":"【id2土豆服の群文件无序优化1.0mod】   QQ群826823481","ip":"120.79.212.67:48887","version":"x24.03.04"},

{"name":"【id3土豆服の测试服无害】   QQ群826823481","ip":"120.76.98.156:28887","version":"x24.03.04"},
{"name":"【id4天空之城】   QQ群826823481","ip":"v.tudouzxc.icu:38887","version":"x24.03.04"},
{"name":"【id5土豆服の生存】   ","ip":"v.tudouzxc.icu","version":"x24.03.04"},

{"name":"【id6土豆服の测试服探险岛屿Mod联机版0.2】   QQ群826823481","ip":"43.139.154.232:28887","version":"x24.03.04"},
{"name":"【id7土豆服の测试服野人岛02.09mod】   QQ群826823481","ip":"43.139.154.232:38887","version":"x24.03.04"},
{"name":"【id8土豆服の测试服混沌领域2.0mod】   QQ群826823481","ip":"43.139.154.232:48887","version":"x24.03.04"},

{"name":"【id9陨石测试服】   ","ip":"103.40.13.68:55666","version":"x24.03.04"},
{"name":"【id10变笑航海时代群240382579】   ","ip":"103.40.13.68:15220","version":"x24.03.04"},
{"name":"【id11[假红包]新版本起床战争BUG测试服1】","ip":"k1.getmc.cn:15122","version":"x24.03.04"},

{"name":"【id12〔高防扛揍长期服〕困难雪地生存】","ip":"mc22.rhymc.com:40243","version":"x24.03.04"},
{"name":"【id13（高防2线）困难雪地生存】","ip":"103.40.13.95:40243","version":"x24.03.04"},
{"name":"【id14［困难生存服］动物掉落矿物测试（动物随机刷新））】   ","ip":"mc22.rhymc.com:40244","version":"x24.03.04"},
{"name":"【id15SC守序联盟x联机玩家交流群862989677【1号】】   ","ip":"mc22.rhymc.com:40249","version":"x24.03.04"},
{"name":"【id16SC守序联盟商店旅馆服，联机玩家交流群862989677【2号】】   ","ip":"rack1.raincs.cc:30007","version":"x24.03.04"},

{"name":"【id17云术生存服】   ","ip":"sc.2s.ink:40119","version":"x24.03.04"},
{"name":"【id18雪球大战官方群337335474】   ","ip":"scza.cn:43999","version":"x24.03.04"},
{"name":"【id19无敌的服务器】   ","ip":"gyj.gxtdy.top:11451","version":"x24.03.04"},
{"name":"【id20hope的ck遥远海平线】   ","ip":"27.25.156.221:25687","version":"x24.03.04"},

{"name":"【id21土豆服の测试】   ","ip":"tudouzxc.icu:50059","version":"x24.03.04"},
{"name":"【id22维护34887】","ip":"tudouzxc.icu:40031","version":"x24.03.04"},

{"name":"【id23温暖小镇【3号】678153253QQ群，】   ","ip":"103.40.13.21:43366","version":"x24.03.04"},
{"name":"【id24hope的ck沙漠生存服   交流群:582405110】   ","ip":"111.180.189.120:37567","version":"x24.03.04"},
{"name":"【id25小黑的平坦指令商店生存】   ","ip":"103.40.13.94:15808","version":"x24.03.04"},
{"name":"【id26荒芜之地】   ","ip":"103.40.13.97:17020","version":"x24.03.04"},
{"name":"【id27亿年冰川    群聊:582405110】   ","ip":"111.180.189.120:57651","version":"x24.03.04"},
{"name":"【id28海外Seph的国际服】   ","ip":"survivalcraft.cc","version":"x24.03.04"},

]
}
SERVER;
echo $serverlist;